Data Wrangling

- 한 원시데이터 -> 다른 형태로 변경

#### isnull

In [102]:
import numpy as np
import pandas as pd

np.random.seed(48)
df = pd.DataFrame(10*np.random.rand(4,2).round(2))
df.columns = ['A', 'B'] # df.columns = ['A', 'B']로 컬럼 명 지정 가능
print(df)

     A    B
0  0.2  8.9
1  2.8  3.0
2  7.9  3.2
3  8.6  4.5

In [103]:
df.A[1] = np.nan # np.nan으로 null 값으로 바꿀 수 있다.
print(df)

     A    B
0  0.2  8.9
1  NaN  3.0
2  7.9  3.2
3  8.6  4.5

In [104]:
df.isnull() # isnull 표로 확인

       A      B
0  False  False
1   True  False
2  False  False
3  False  False

In [105]:
df.isnull().sum() # isnull 개수

A    1
B    0
dtype: int64

##### dropna

In [106]:
df2 = df.dropna() # default : axis = 0(행)

In [107]:
df2

     A    B
0  0.2  8.9
2  7.9  3.2
3  8.6  4.5

In [108]:
df2 = df.dropna(axis = 1) # axis = 1(열)

In [109]:
df2

     B
0  8.9
1  3.0
2  3.2
3  4.5

In [110]:
df.dropna(how = 'all') # 결측치로 가득찬 행 제거

     A    B
0  0.2  8.9
1  NaN  3.0
2  7.9  3.2
3  8.6  4.5

In [111]:
df.B[1] = np.nan
df.A[0] = np.nan
df

     A    B
0  NaN  8.9
1  NaN  NaN
2  7.9  3.2
3  8.6  4.5

In [112]:
df.dropna(thresh = 1) # 결측치 1개 이상인 행 제거

     A    B
0  NaN  8.9
2  7.9  3.2
3  8.6  4.5

##### fillna
- nan인 곳을 해당하는 값으로 채우기

In [113]:
df

     A    B
0  NaN  8.9
1  NaN  NaN
2  7.9  3.2
3  8.6  4.5

- 이렇게 채워도 된다.

In [114]:
idx = df.isnull()
df[idx] = 1

In [115]:
df

     A    B
0  1.0  8.9
1  1.0  1.0
2  7.9  3.2
3  8.6  4.5

- 앞의 걸로 채우기(method = 'ffill')
- 뒤의 걸로 채우기(method = 'bfill')

In [116]:
df.A[2] = np.nan
df

     A    B
0  1.0  8.9
1  1.0  1.0
2  NaN  3.2
3  8.6  4.5

In [119]:
df

     A    B
0  1.0  8.9
1  1.0  1.0
2  NaN  3.2
3  8.6  4.5

In [117]:
df3 = df.fillna(method = 'bfill', axis = 1)
df3

     A    B
0  1.0  8.9
1  1.0  1.0
2  3.2  3.2
3  8.6  4.5

In [118]:
df4 = df.fillna(method = 'ffill', axis = 0)
df4

     A    B
0  1.0  8.9
1  1.0  1.0
2  1.0  3.2
3  8.6  4.5

In [120]:
df5 = df.fillna(method = 'bfill', axis = 1)
df5

     A    B
0  1.0  8.9
1  1.0  1.0
2  3.2  3.2
3  8.6  4.5